app/Http/Controllers/EmployeeController.php

select * from `employees` limit 5 offset 0
select count(*) as aggregate from `employees`
---
    public function index()
    {
        $employees = Employee::paginate(5);

select * from `employees` where `employees`.`id` = '1' limit 1
---
    public function show($id)
    {
        $employee = Employee::find($id);